lib/tasks/calltimes.rake

SELECT `campaigns`.* FROM `campaigns` WHERE NOT ((`campaigns`.`schedule_start` = NULL OR `campaigns`.`schedule_start` IS NULL)) AND NOT ((`campaigns`.`schedule_end` = NULL OR `campaigns`.`schedule_end` IS NULL))
---
  task check: :environment do

    # Your task goes here
    campaigns_to_check = Campaign.where.not(schedule_start: [nil, ''], schedule_end: [nil, ''])
    campaigns_to_check.each do |campaign|