lib/tasks/db.rake

  task genfakedata: :environment do
    50.times do
      # random info
      user = User.all.sample
      did = user.dids.all.sample
---
SELECT `users`.* FROM `users`
SELECT `dids`.* FROM `dids` INNER JOIN `funnels` ON `dids`.`funnel_id` = `funnels`.`id` WHERE `funnels`.`user_id` = 1