lib/tasks/vicidial.rake

  task check_no_funnel_dids: :environment do

    # Your task goes here
		dids_to_check = Did.where(funnel_id: nil)

		dids_to_check.each do |did|
---
SELECT `dids`.* FROM `dids` WHERE `dids`.`funnel_id` IS NULL

  task update_all_dids: :environment do

    # Your task goes here
		dids_to_update = Did.all

		dids_to_update.each do |did|
---
SELECT `dids`.* FROM `dids`