app/views/sources/_index.html.erb

SELECT `sources`.* FROM `sources` WHERE `sources`.`user_id` = 1
---
      <tbody>
        <% current_user.sources.each do |source| %>