app/views/verticals/_edit.html.erb

SELECT `verticals`.* FROM `verticals` WHERE `verticals`.`user_id` = 1
---
    <tbody>
      <% current_user.verticals.each do |vertical| %>