app/views/verticals/_index.html.erb

      <tbody>
        <% current_user.verticals.each do |vertical| %>
---
SELECT `verticals`.* FROM `verticals` WHERE `verticals`.`user_id` = 2