app/views/ivrs/_index.html.erb

      <tbody>
        <% if current_user.ivrs.blank? %>
---
SELECT `ivrs`.* FROM `ivrs` WHERE `ivrs`.`user_id` = 1