app/views/ivrs/_new.html.erb

SELECT `ivrs`.* FROM `ivrs` WHERE `ivrs`.`user_id` = 1
---
  <%= form_for :ivr, url: ivrs_path(@ivr), method: :post, remote: true do |f| %>
    <% current_user.ivrs.each do |ivr| %>