app/helpers/dashboards_helper.rb

	def setup_status
		html = "<p>".html_safe
		if current_user.campaigns.blank?
			link = link_to('new destination', campaigns_path, remote: true, style: 'color:#1da3ed;')
			html.safe_concat("Your first step in setting up your account is to create a #{link}. ")
		end
		if current_user.funnels.blank?
---
SELECT `campaigns`.* FROM `campaigns` INNER JOIN `verticals` ON `campaigns`.`vertical_id` = `verticals`.`id` WHERE `verticals`.`user_id` = 2
SELECT `campaigns`.* FROM `campaigns` INNER JOIN `verticals` ON `campaigns`.`vertical_id` = `verticals`.`id` WHERE `verticals`.`user_id` = 1
SELECT `funnels`.* FROM `funnels` WHERE `funnels`.`user_id` = 2