app/views/funnels/_index.html.erb

<h3><%= link_to 'Dashboard', dashboard_path, remote: true, style: 'color:#1da3ed;' %> / <%= link_to 'Funnels', funnels_path, remote: true, style: 'color:#1da3ed;' %> /
  <% if current_user.campaigns.blank? %>
---
SELECT `campaigns`.* FROM `campaigns` INNER JOIN `verticals` ON `campaigns`.`vertical_id` = `verticals`.`id` WHERE `verticals`.`user_id` = 1

      <tbody>
        <% if current_user.funnels.blank? %>
---
SELECT `funnels`.* FROM `funnels` WHERE `funnels`.`user_id` = 1