app/views/dashboards/_quickview_sources.html.erb

      <tbody>
        <% if current_user.sources.blank? %>
---
SELECT `sources`.* FROM `sources` WHERE `sources`.`user_id` = 2