app/views/dashboards/_quickview_dids.html.erb

      <tbody>
        <% if current_user.dids.blank? %>
---
SELECT `dids`.* FROM `dids` INNER JOIN `funnels` ON `dids`.`funnel_id` = `funnels`.`id` WHERE `funnels`.`user_id` = 1

        <% else %>
          <% current_user.dids.includes(:funnel).each do |did| %>
---
SELECT `funnels`.* FROM `funnels` WHERE `funnels`.`user_id` = 1