app/views/dashboards/_quickview_verticals.html.erb

      <tbody>
        <% if current_user.verticals.blank? %>
---
SELECT `verticals`.* FROM `verticals` WHERE `verticals`.`user_id` = 2