app/controllers/campaigns_controller.rb

SELECT  `verticals`.* FROM `verticals` WHERE `verticals`.`user_id` = 1 AND `verticals`.`id` = 6 LIMIT 1
INSERT INTO `campaigns` (`vertical_id`, `name`, `campaign_type`, `client_did`, `schedule_start`, `schedule_end`, `blocked_states`, `order_total`, `daily_call_limit`, `concurrent_call_limit`, `buyer_balance`, `buffer`, `lead_cost`, `created_at`, `updated_at`) VALUES (6, 'test', 0, '18888888888', '0001-01-01 00:00:00', '0001-01-01 00:00:00', '---\n- \'\'\n- AK\n', '111', '1', '1', '1', '20', '1', '2021-11-19 08:46:10', '2021-11-19 08:46:10')
---
  def create
    vertical = current_user.verticals.find_by_id(params['campaign']['vertical_id'])
    respond_to do |format|
      if vertical
        @campaign = vertical.campaigns.build(campaign_params)
        if @campaign.save

SELECT  `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1
---
  def edit
    @campaign = Campaign.find(params[:id])

SELECT  `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1
UPDATE `campaigns` SET `active` = FALSE, `updated_at` = '2021-11-19 08:49:30' WHERE `campaigns`.`id` = 1
---
  def update
    @campaign = Campaign.find(params[:id])
    @campaign.update_attributes(campaign_params)