app/controllers/dashboards_controller.rb

SELECT  `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` IS NULL LIMIT 1
---
  def show
    user = current_user
    if user.buyer?
      @active = 'buyers'
      @campaign = Campaign.find_by(id: current_user.buyer_campaign_id)

SELECT  `funnels`.* FROM `funnels` WHERE `funnels`.`id` = NULL LIMIT 1
SELECT  `verticals`.* FROM `verticals` WHERE `verticals`.`id` = NULL LIMIT 1
SELECT  `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = NULL LIMIT 1
---
  def filter_dids
    funnel = Funnel.find_by_id(params[:did_filter][:funnel_id])
    vertical = Vertical.find_by_id(params[:did_filter][:vertical_id])
    campaign = Campaign.find_by_id(params[:did_filter][:campaign_id])