app/controllers/funnels_controller.rb

  def buy_dids
    @funnel = Funnel.find_by_id(params[:funnel][:id])
---
SELECT  `funnels`.* FROM `funnels` WHERE `funnels`.`id` = NULL LIMIT 1