app/controllers/sources_controller.rb

  def edit
    @source = Source.find(params[:id])
---
SELECT  `sources`.* FROM `sources` WHERE `sources`.`id` = 4 LIMIT 1

  def update
    @source = Source.find(params[:id])
---
SELECT  `sources`.* FROM `sources` WHERE `sources`.`id` = 4 LIMIT 1