app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `password_digest`, `confirm_token`, `password_reset_token`, `created_at`, `updated_at`) VALUES ('deltranet@mail.com', '$2a$12$uY84usYIidGeMX7iA.JH/uz86R31ksdL1YYVRtorJFm8HT.uL1P6q', 'CUshZMsnjh4tApTXWjvp79tF', 'iKrmZAJnYqKNZuv1UGE6DWKp', '2021-11-07 06:22:28', '2021-11-07 06:22:28')
---
  def create
    @user = User.new(user_params)

    # Store all emails in lowercase to avoid duplicates and case-sensitive login errors:
    @user.email.downcase!

    if @user.save