app/controllers/verticals_controller.rb

  def edit
    @vertical = Vertical.find(params[:id])
---
SELECT  `verticals`.* FROM `verticals` WHERE `verticals`.`id` = 6 LIMIT 1