app/views/campaigns/_edit.html.erb

          <label for='' class="col-form-label">Vertical</label>
          <%= f.select :vertical_id, current_user.verticals.collect { |v| [ v.name, v.id ] }, { prompt: 'Select Vertical' }, class: 'form-control select-drop' %>
---
SELECT `verticals`.* FROM `verticals` WHERE `verticals`.`user_id` = 1

      <div class="from-group col-md-6">
        <% if current_user.funnels.blank? %>
---
SELECT `funnels`.* FROM `funnels` WHERE `funnels`.`user_id` = 1