app/views/campaigns/_index.html.erb

SELECT `campaigns`.* FROM `campaigns` INNER JOIN `verticals` ON `campaigns`.`vertical_id` = `verticals`.`id` WHERE `verticals`.`user_id` = 1
---
      <tbody>
        <% if current_user.campaigns.blank? %>