app/views/campaigns/_new.html.erb

SELECT `campaigns`.* FROM `campaigns` INNER JOIN `verticals` ON `campaigns`.`vertical_id` = `verticals`.`id` WHERE `verticals`.`user_id` = 1
---
  <%= form_for :campaign, url: campaigns_path(@campaign), method: :post, remote: true do |f| %>
    <% current_user.campaigns.each do |campaign| %>

SELECT `verticals`.* FROM `verticals` WHERE `verticals`.`user_id` = 1
---
            <label for='' class="col-form-label">Vertical</label>
            <%= f.select :vertical_id, current_user.verticals.collect { |v| [ v.name, v.id ] }, { prompt: 'Select Vertical' }, class: 'form-control select-drop' %>