app/models/user.rb

  def set_defaults
    vertical_names = [
      'Auto Finance',
      'Auto Insurance (Basic)',
      'Auto Insurance (Advanced)',
      'Auto Warranty',
      'Byetta',
      'Debt Consolidation',
      'Diabetic',
      'Education',
      'Granuflo',
      'Health Insurance',
      'Hip Replacement',
      'Home Improvement',
      'Life Insurance',
      'Low Testosterone',
      'Mortgage',
      'Mortgage Refinance',
      'New Car Purchase',
      'Pain Cream',
      'Payday (US)',
      'Payday (UK)',
      'Satellite Television',
      'Social Security Disability (SSD)',
      'Tax Debt',
      'Transvaginal Mesh (TVM)',
      'Yaz/Yasmin/Ocella'
    ]
    vertical_names.each do |vertical_name|
      self.verticals.create(name: vertical_name)
---
INSERT INTO "verticals" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["name", "Auto Finance"], ["created_at", "2021-12-20 18:34:31.115943"], ["updated_at", "2021-12-20 18:34:31.115943"]]

      'Direct Mail'
    ]
    source_names.each do |source_name|
      self.sources.create(name: source_name)
    end

    #Set billing rate to the global default:
    self.billing_rate = Global.find_by_name('default_billing_rate').value
---
INSERT INTO "sources" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["name", "Email"], ["created_at", "2021-12-20 18:34:31.326580"], ["updated_at", "2021-12-20 18:34:31.326580"]]
SELECT  "globals".* FROM "globals" WHERE "globals"."name" = $1 LIMIT $2  [["name", "default_billing_rate"], ["LIMIT", 1]]